/**
  vars.h - header unit for quest Chudesa
 * @Author Vasiliy A. Ponomarjov August 31, 2015
 * @modified Vasiliy A. Ponomarjov August 31, 2015
 * @email vas@vingrad.ru
*/

//Контакты
//сдвиговый регистр
#define LATCH_PIN                8            //Пин подключен к ST_CP входу 74HC595
#define CLOCK_PIN               12            //Пин подключен к SH_CP входу 74HC595
#define DATA_PIN                11            //Пин подключен к DS входу 74HC595
//клавиатура                    
#define KBRD_IRQ_PIN             3             //пин прерывания клавиатуры
#define KBRD_DATA_PIN            2             //пин данных клавиатуры
//звук
#define BUSY  13                               // LOW во время воспроизведения
#define S_RX   9                               // RX for management player
#define S_TX  10                               // TX for management player


//состояния -  работаем, ожжидаем или программируемся
enum { 
  WAITING,
  PLAYING, 
  PROGRAMMING 
} state;       

//клавиатура
PS2Keyboard Keyboard;
uint8_t key;  //код нажатой клавиши

//массив соотношения скан кодов клавиш и номеров картинок 
//картинки считаются  с нуля, код -1 - клавиша не используется
int8_t cells[131] = {
  -1,  0, -1,  1,  2,  3,  4,  5,
  -1,  6,  7,  8,  9, 10, 11, -1,
  -1, 12, 13, -1, 14, 15, 16, -1,
  -1,	-1, 17, 18, 19, 20, 21, -1,
  -1, 22, 23, 24, 25, 26, 27, -1,
  -1, 28, 29, 30, 31, 32, 33, -1,
  -1,	30, 31, 32, 33, 34, 35, -1,
  -1,	-1,	36, 37, 38, 39, 40, -1,
  -1, 41, 42, 43, 44, 45, 46, -1,
  -1,	47, 48, 49, 50, 51, 52, -1,
  -1, -1, 53, -1, 54, 55, -1, -1,
  56, 57, 58, 59, -1, 60, -1, -1,
  -1, -1, -1, -1, -1, -1, 61, -1,
  -1, -1, -1, -1, -1, -1, -1, -1,
  -1, -1, -1, -1, -1, -1, 62, -1, 
  63, -1, -1, -1, -1, -1, -1, -1,
  -1, -1, -1
};



